# -*- coding: utf-8 -*-
"""

=================================
Author: keen
Created on: 2019/10/5

E-mail:keen2020@outlook.com

=================================


"""

data = [
    # {"user": "15527579670", "pwd": "579670"},
    # {"user": "18621930442", "pwd": "bao123"},
    {"user": "13072721092", "pwd": "123456"},
    # {"user": "15533366622", "pwd": "123456"}
]

success_data = data

# 密码为空/用户名为空/用户名格式不正确
no_user = [{"user": "", "pwd": "123456", "check": "请输入账号"}]
no_pwd = [{"user": "13072721092", "pwd": "", "check": "请输入密码"}]

# 用户名未注册 /密码错误
wrong_data = [
    {"user": "13072721092", "pwd": "12345", "check": "账号不存在或者密码有误"},
    {"user": "13072721099", "pwd": "123456", "check": "账号不存在或者密码有误"},
    {"user": "13000000000", "pwd": "000000", "check": "账号不存在或者密码有误"}
]
